Revit 2027 API
PathOfTravel.IsInRevealObstaclesMode Method
 Returns current state of Reveal Obstacles mode for the given view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsInRevealObstaclesMode(
	View DBView
)
Public Shared Function IsInRevealObstaclesMode (
	DBView As View
) As Boolean
public:
static bool IsInRevealObstaclesMode(
	View^ DBView
)
static member IsInRevealObstaclesMode :
        DBView : View -> bool
Parameters
DBView View
 The view to determine current state of Reveal Obstacles mode for.
Return Value
Boolean
 True if Reveal Obstacles mode is ON for the view, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The element "DBView" is in a family document or a document in in-place edit mode. -or- View is not a floor plan view.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document containing DBView is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The Path of Travel calculation service is not available
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace